Repository: yeager/swedish-tm
Catalog: sv-weblate.tmx
Source language: en
Languages: sv

source: Fluent is often used in contexts where the value for a Message (or Term) is meant to be used directly as ``.innerHTML`` (rather than ``.textContent``) for some HTML element. For example, when using the Fluent DOM package.
sv: Fluent anvÃ¤nds ofta i sammanhang dÃ¤r vÃ¤rdet fÃ¶r ett meddelande (eller term) Ã¤r avsett att anvÃ¤ndas direkt som ``.innerHTML`` (istÃ¤llet fÃ¶r ``.textContent``) fÃ¶r vissa HTML-element. Till exempel nÃ¤r man anvÃ¤nder Fluent DOM-paketet.

source: The aim of this check is to predict how the value will be parsed as inner HTML, assuming a HTML5 conforming parser, to catch cases where there would be some "unintended" loss of the string, without being too strict about technical parsing errors that do *not* lead to a loss of the string.
sv: Syftet med denna kontroll Ã¤r att fÃ¶rutsÃ¤ga hur vÃ¤rdet kommer att analyseras som inre HTML, fÃ¶rutsatt att det finns en HTML5-kompatibel analysator, fÃ¶r att upptÃ¤cka fall dÃ¤r det skulle kunna uppstÃ¥ en "oavsiktlig" fÃ¶rlust av strÃ¤ngen, utan att vara fÃ¶r strikt nÃ¤r det gÃ¤ller tekniska analysfel som *inte* leder till en fÃ¶rlust av strÃ¤ngen.

source: This check is applied to the value of Fluent Messages or Terms, but not their Attributes. For Messages, the Fluent Attributes are often just HTML attribute values, so can be arbitrary strings. For Terms, the Fluent Attributes are often language properties that can only be referenced in the selectors of Fluent Select Expressions.
sv: Denna kontroll tillÃ¤mpas pÃ¥ vÃ¤rdet av Fluent Messages eller Terms, men inte pÃ¥ deras attribut. FÃ¶r Messages Ã¤r Fluent-attributen ofta bara HTML-attributvÃ¤rden, sÃ¥ de kan vara godtyckliga strÃ¤ngar. FÃ¶r Terms Ã¤r Fluent-attributen ofta sprÃ¥kgenskaper som endast kan refereras till i selektorerna fÃ¶r Fluent Select Expressions.

source: Generally, most Fluent values are not expected to contain any HTML markup. Therefore, this check does not expect or want translators and developers to have to care about strictly avoiding *any* technical HTML5 parsing errors (let alone XHTML parsing errors). Instead, this check will just want to warn them when they may have unintentionally opened a HTML tag or inserted a character reference.
sv: I allmÃ¤nhet fÃ¶rvÃ¤ntas de flesta Fluent-vÃ¤rden inte innehÃ¥lla nÃ¥gon HTML-markering. DÃ¤rfÃ¶r fÃ¶rvÃ¤ntar sig eller krÃ¤ver denna kontroll inte att Ã¶versÃ¤ttare och utvecklare strikt undviker *alla* tekniska HTML5-parsningsfel (fÃ¶r att inte tala om XHTML-parsningsfel). IstÃ¤llet vill denna kontroll bara varna dem nÃ¤r de oavsiktligt har Ã¶ppnat en HTML-tagg eller infogat en teckenreferens.

source: Moreover, for the Fluent values that intentionally contain HTML tags or character references, this check will verify some "good practices", such as matching closing and ending tags, valid character references, and quoted attribute values. In addition, whilst the HTML5 specification technically allows for quite arbitrary tag and attribute names, this check will restrain them to some basic ASCII values that should cover the standard HTML5 element tags and attributes, as well as allow *some* custom element or attribute names. This is partially to ensure that the user is using HTML intentionally.
sv: Dessutom kommer denna kontroll, fÃ¶r Fluent-vÃ¤rden som avsiktligt innehÃ¥ller HTML-taggar eller teckenreferenser, att verifiera vissa "god praxis", sÃ¥som matchande slut- och avslutningstaggar, giltiga teckenreferenser och citerade attributvÃ¤rden. Ãven om HTML5-specifikationen tekniskt sett tillÃ¥ter ganska godtyckliga tagg- och attributnamn, kommer denna kontroll att begrÃ¤nsa dem till vissa grundlÃ¤ggande ASCII-vÃ¤rden som bÃ¶r tÃ¤cka standard HTML5-elementtaggar och -attribut, samt tillÃ¥ta *vissa* anpassade element- eller attributnamn. Detta Ã¤r delvis fÃ¶r att sÃ¤kerstÃ¤lla att anvÃ¤ndaren anvÃ¤nder HTML avsiktligt.

source: Examples:
sv: Exempel:

source: Fluent inner HTML examples
sv: Flytande interna HTML-exempel

source: Warns?
sv: Varnar?

source: The ``<four`` part would be lost as ``.innerHTML``.
sv: Den delen som heter ``<four`` skulle fÃ¶rsvinna som ``.innerHTML``.

source: The ``.innerHTML`` would match the ``.textContent``.
sv: ``.innerHTML`` skulle matcha ``.textContent``.

source: Missing a closing tag.
sv: Slutstaggen saknas.

source: ``four`` is not a HTML void element, so should not self-close.
sv: ``four`` Ã¤r inte ett HTML-tomt element, sÃ¥ det bÃ¶r inte stÃ¤ngas automatiskt.

source: Custom element tag with a matching closing tag.
sv: Anpassad elementtagg med en matchande avslutande tagg.

source: ``img`` is a HTML void element. Self-closing is allowed.
sv: ``img`` Ã¤r ett HTML-tomt element. SjÃ¤lvstÃ¤ngande Ã¤r tillÃ¥tet.

source: ``br`` is a HTML void element.
sv: ``br`` Ã¤r ett HTML-tomt element.

source: The attribute value is not quoted.
sv: AttributvÃ¤rdet Ã¤r inte angivet inom citationstecken.

source: Non-ASCII tag name.
sv: Icke-ASCII-taggnamn.

source: The ``&eth`` part would be converted to ``Ã°``.
sv: Delarna ``&eth`` skulle konverteras till ``Ã°``.

source: The character reference seems to be intentional.
sv: KaraktÃ¤rsreferensen verkar vara avsiktlig.

source: The ``&lte;`` part would be converted to ``<e;``.
sv: Delen ``<e;`` skulle konverteras till ``<e;``.

source: The character reference is not valid.
sv: KaraktÃ¤rsreferensen Ã¤r ogiltig.

source: The Fluent variable may unintentionally become a tag.
sv: Variabeln Fluent kan oavsiktligt bli en tagg.

source: The Fluent variable may unintentionally become a character reference.
sv: Variabeln Fluent kan oavsiktligt bli en teckenreferens.

source: This check will *not* ensure the inner HTML is safe or sanitized, and is not meant to protect against malicious attempts to alter the inner HTML. Moreover, it should be remembered that Fluent variables and references may expand to arbitrary strings, so could expand to arbitrary HTML unless they are escaped. As an exception, a ``<`` or ``&`` character before a Fluent reference will trigger this check since even an escaped value could lead to unexpected results.
sv: Denna kontroll garanterar *inte* att den inre HTML-koden Ã¤r sÃ¤ker eller sanerad, och Ã¤r inte avsedd att skydda mot skadliga fÃ¶rsÃ¶k att Ã¤ndra den inre HTML-koden. Dessutom bÃ¶r man komma ihÃ¥g att Fluent-variabler och referenser kan expandera till godtyckliga strÃ¤ngar, sÃ¥ de kan expandera till godtycklig HTML om de inte Ã¤r undantagna. Som ett undantag kommer ett ``<``- eller ``&``-tecken fÃ¶re en Fluent-referens att utlÃ¶sa denna kontroll, eftersom Ã¤ven ett undantaget vÃ¤rde kan leda till ovÃ¤ntade resultat.

source: The Fluent DOM package has further limitations, such as allowed tags and attributes, which this check will not enforce.
sv: Fluent DOM-paketet har ytterligare begrÃ¤nsningar, sÃ¥som tillÃ¥tna taggar och attribut, som denna kontroll inte kommer att tillÃ¤mpa.

source: In Weblate, Fluent strings use Fluent syntax for references and variables, but also for more complex features like defining attributes and selector variants, including plurals. This check ensures that the syntax used in source will be valid for Fluent.
sv: I Weblate anvÃ¤nder Fluent-strÃ¤ngar Fluent-syntax fÃ¶r referenser och variabler, men ocksÃ¥ fÃ¶r mer komplexa funktioner som att definiera attribut och selektorsvarianter, inklusive pluralformer. Denna kontroll sÃ¤kerstÃ¤ller att syntaxen som anvÃ¤nds i kÃ¤llkoden Ã¤r giltig fÃ¶r Fluent.

source: When the string has not been translated for a long time, it can indicate a problem in a source string making it hard to translate.
sv: Om strÃ¤ngen inte har Ã¶versatts pÃ¥ lÃ¤nge kan det tyda pÃ¥ ett problem i kÃ¤llstrÃ¤ngen som gÃ¶r den svÃ¥r att Ã¶versÃ¤tta.

source: Numerous translations of this string have failing quality checks. This is usually an indication that something could be done to improve the source string.
sv: MÃ¥nga Ã¶versÃ¤ttningar av denna strÃ¤ng har underkÃ¤nts i kvalitetskontroller. Detta Ã¤r vanligtvis ett tecken pÃ¥ att nÃ¥got kan gÃ¶ras fÃ¶r att fÃ¶rbÃ¤ttra kÃ¤llstrÃ¤ngen.

source: This check failing can quite often be caused by a missing full stop at the end of a sentence, or similar minor issues which translators tend to fix in translation, while it would be better to fix it in the source string.
sv: Denna kontroll misslyckas ofta pÃ¥ grund av att en punkt saknas i slutet av en mening eller liknande mindre problem som Ã¶versÃ¤ttare tenderar att Ã¥tgÃ¤rda i Ã¶versÃ¤ttningen, medan det skulle vara bÃ¤ttre att Ã¥tgÃ¤rda det i kÃ¤llstrÃ¤ngen.

source: Consider using named variables instead to allow translators to reorder them.
sv: ÃvervÃ¤g att anvÃ¤nda namngivna variabler istÃ¤llet sÃ¥ att Ã¶versÃ¤ttarna kan ordna om dem.

source: The string is used as a plural, but does not use plural forms. In case your translation system supports this, you should use the plural aware variant of it.
sv: StrÃ¤ngen anvÃ¤nds som plural, men anvÃ¤nder inte pluralformer. Om ditt Ã¶versÃ¤ttningssystem stÃ¶der detta bÃ¶r du anvÃ¤nda den pluralmedvetna varianten av den.

source: For example with Gettext in Python it could be:
sv: Med Gettext i Python kan det till exempel se ut sÃ¥ hÃ¤r:

source: Placeables in automatic suggestion
sv: Placerbara objekt i automatiska fÃ¶rslag

source: Checks for placeables expose information on current placeables and this can be used to instruct automatic suggestion engines to keep them. The support for this varies in different services and in many cases there is no way to enforce keeping placeables intact.
sv: Kontroller av placerbara objekt visar information om aktuella placerbara objekt, och detta kan anvÃ¤ndas fÃ¶r att instruera automatiska fÃ¶rslagsmotorer att behÃ¥lla dem. StÃ¶det fÃ¶r detta varierar mellan olika tjÃ¤nster, och i mÃ¥nga fall finns det inget sÃ¤tt att tvinga fram att placerbara objekt behÃ¥lls intakta.

source: Downloading and uploading translations
sv: Ladda ner och ladda upp Ã¶versÃ¤ttningar

source: You can export files from a translation, make changes, and import them again. This allows working offline, and then merging changes back into the existing translation. This works even if it has been changed in the meantime.
sv: Du kan exportera filer frÃ¥n en Ã¶versÃ¤ttning, gÃ¶ra Ã¤ndringar och importera dem igen. Detta gÃ¶r det mÃ¶jligt att arbeta offline och sedan slÃ¥ samman Ã¤ndringarna med den befintliga Ã¶versÃ¤ttningen. Detta fungerar Ã¤ven om den har Ã¤ndrats under tiden.

source: Available options might be limited by :ref:`access control <access-control>` settings.
sv: TillgÃ¤ngliga alternativ kan begrÃ¤nsas av instÃ¤llningarna fÃ¶r :ref:`Ã¥tkomstkontroll <access-control>`.

source: Downloading translations
sv: Ladda ner Ã¶versÃ¤ttningar

source: From the project or component dashboard, translatable files can be downloaded in the :guilabel:`Files` menu.
sv: FrÃ¥n projekt- eller komponentpanelen kan Ã¶versÃ¤ttningsbara filer laddas ner i menyn :guilabel:`Filer`.

source: The first option is to download the file in the original format as it is stored in the repository. In this case, any pending changes in the translation are getting committed and the up-to-date file is yield without any conversions.
sv: Det fÃ¶rsta alternativet Ã¤r att ladda ner filen i originalformatet sÃ¥ som den lagras i arkivet. I det hÃ¤r fallet bekrÃ¤ftas alla vÃ¤ntande Ã¤ndringar i Ã¶versÃ¤ttningen och den uppdaterade filen levereras utan nÃ¥gon konvertering.

source: You can also download the translation converted into one of the widely used localization formats. The converted files will be enriched with data provided in Weblate; such as additional context, comments or flags. Several file formats are available via the :guilabel:`Files` â :guilabel:`Customize download` menu:
sv: Du kan ocksÃ¥ ladda ner Ã¶versÃ¤ttningen konverterad till ett av de vanligaste lokaliseringsformaten. De konverterade filerna kommer att berikas med data frÃ¥n Weblate, sÃ¥som ytterligare sammanhang, kommentarer eller flaggor. Flera filformat Ã¤r tillgÃ¤ngliga via menyn :guilabel:`Filer` â :guilabel:`Anpassa nedladdning`:

source: XLIFF 1.1 with gettext extensions (``xliff``)
sv: XLIFF 1.1 med gettext-tillÃ¤gg (``xliff``)

source: gettext MO (only available when translation is using gettext PO) (``mo``)
sv: gettext MO (endast tillgÃ¤ngligt nÃ¤r Ã¶versÃ¤ttningen anvÃ¤nder gettext PO) (``mo``)

source: JSON (only available for monolingual translations) (``json``)
sv: JSON (endast tillgÃ¤ngligt fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar) (``json``)

source: JSON nested structure file (only available for monolingual translations) (``json-nested``)
sv: JSON-fil med nÃ¤stlad struktur (endast tillgÃ¤nglig fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar) (``json-nested``)

source: Android String Resource (only available for monolingual translations) (``aresource``)
sv: Android-strÃ¤ngresurs (endast tillgÃ¤nglig fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar) (``aresource``)

source: iOS strings (only available for monolingual translations) (``strings``)
sv: iOS-strÃ¤ngar (endast tillgÃ¤ngliga fÃ¶r ensprÃ¥kiga Ã¶versÃ¤ttningar) (``strings``)

source: The content available in the converted files differs based on file format features, you can find overview in :ref:`fmt_capabs`.
sv: InnehÃ¥llet i de konverterade filerna varierar beroende pÃ¥ filformatets egenskaper. Du hittar en Ã¶versikt i :ref:`fmt_capabs`.

source: Downloading components, categories or projects
sv: Ladda ner komponenter, kategorier eller projekt

source: Translation files for a component, category or project can be downloaded at once via the :guilabel:`Files` menu. The download is always served as a ZIP file, and you can choose original or converted formats similarly as in :ref:`download`.
sv: ÃversÃ¤ttningsfiler fÃ¶r en komponent, kategori eller ett projekt kan laddas ner samtidigt via menyn :guilabel:`Files`. Nedladdningen sker alltid som en ZIP-fil, och du kan vÃ¤lja mellan originalformat eller konverterade format pÃ¥ samma sÃ¤tt som i :ref:`download`.

source: Uploading translations
sv: Ladda upp Ã¶versÃ¤ttningar

source: When you have made your changes, use :guilabel:`Upload translation` in the :guilabel:`Files` menu.
sv: NÃ¤r du har gjort dina Ã¤ndringar, anvÃ¤nd :guilabel:`Ladda upp Ã¶versÃ¤ttning` i menyn :guilabel:`Filer`.

source: Supported file formats
sv: StÃ¶dda filformat

source: Any file in a supported file format can be uploaded, but it is still recommended to use the same file format as the one used for translation, otherwise some features might not be translated properly.
sv: Alla filer i ett filformat som stÃ¶ds kan laddas upp, men det rekommenderas Ã¤ndÃ¥ att anvÃ¤nda samma filformat som det som anvÃ¤nds fÃ¶r Ã¶versÃ¤ttningen, annars kan vissa funktioner kanske inte Ã¶versÃ¤ttas korrekt.

source: Import methods
sv: Importmetoder

source: These are the choices presented when uploading translation files:
sv: Dessa alternativ visas nÃ¤r du laddar upp Ã¶versÃ¤ttningsfiler:

source: Add as translation (``translate``)
sv: LÃ¤gg till som Ã¶versÃ¤ttning (``Ã¶versÃ¤tt``)

source: Only translations are used from the uploaded file and no additional content.
sv: Endast Ã¶versÃ¤ttningar frÃ¥n den uppladdade filen anvÃ¤nds, inget ytterligare innehÃ¥ll.

source: This option is available only if the user has the :ref:`"Edit strings" permission <privileges>`.
sv: Det hÃ¤r alternativet Ã¤r bara tillgÃ¤ngligt om anvÃ¤ndaren har behÃ¶righeten :ref:`"Redigera strÃ¤ngar" <privileges>`.

source: Add as suggestion (``suggest``)
sv: LÃ¤gg till som fÃ¶rslag (``suggest``)

source: This option is available only if the user has the :ref:`"Add suggestion" permission <privileges>`.
sv: Det hÃ¤r alternativet Ã¤r bara tillgÃ¤ngligt om anvÃ¤ndaren har behÃ¶righeten :ref:`"LÃ¤gg till fÃ¶rslag" <privileges>`.

source: Add as approved translation (``approve``)
sv: LÃ¤gg till som godkÃ¤nd Ã¶versÃ¤ttning (``godkÃ¤nn``)

source: This option is available only if the user has the :ref:`"Review strings" permission <privileges>`.
sv: Det hÃ¤r alternativet Ã¤r bara tillgÃ¤ngligt om anvÃ¤ndaren har behÃ¶righeten :ref:`"Granska strÃ¤ngar" <privileges>`.

source: Add as translation needing edit (``fuzzy``)
sv: LÃ¤gg till som Ã¶versÃ¤ttning som behÃ¶ver redigeras (``fuzzy``)

source: Replace existing translation file (``replace``)
sv: ErsÃ¤tt befintlig Ã¶versÃ¤ttningsfil (``replace``)

source: This option is available only if the user has the :ref:`"Edit component settings" permission or "Add new string", "Remove a string" and "Edit strings" permissions <privileges>`.
sv: Det hÃ¤r alternativet Ã¤r bara tillgÃ¤ngligt om anvÃ¤ndaren har behÃ¶righeten :ref:`"Redigera komponentinstÃ¤llningar" eller behÃ¶righeterna "LÃ¤gg till ny strÃ¤ng", "Ta bort en strÃ¤ng" och "Redigera strÃ¤ngar" <privileges>`.

source: Update source strings (``source``)
sv: Uppdatera kÃ¤llstrÃ¤ngar (``source``)

source: Updates source strings in bilingual translation file. This is similar to what :ref:`addon-weblate.gettext.msgmerge` does.
sv: Uppdaterar kÃ¤llstrÃ¤ngar i tvÃ¥sprÃ¥kig Ã¶versÃ¤ttningsfil. Detta liknar vad :ref:`addon-weblate.gettext.msgmerge` gÃ¶r.

source: This option is available only for some file formats and only if the user has the :ref:`"Upload translations" permission <privileges>`.
sv: Det hÃ¤r alternativet Ã¤r bara tillgÃ¤ngligt fÃ¶r vissa filformat och bara om anvÃ¤ndaren har behÃ¶righeten :ref:`"Ladda upp Ã¶versÃ¤ttningar" <privileges>`.

source: Add new strings (``add``)
sv: LÃ¤gg till nya strÃ¤ngar (``add``)

source: In case you want to both add new strings and update existing translations, upload the file second time with :guilabel:`Add as translation`.
sv: Om du vill bÃ¥de lÃ¤gga till nya strÃ¤ngar och uppdatera befintliga Ã¶versÃ¤ttningar, ladda upp filen en andra gÃ¥ng med :guilabel:`LÃ¤gg till som Ã¶versÃ¤ttning`.

source: Only source, translation and key (context) are used from the uploaded file.
sv: Endast kÃ¤llan, Ã¶versÃ¤ttningen och nyckeln (kontexten) anvÃ¤nds frÃ¥n den uppladdade filen.

source: This option is available only with :ref:`component-manage_units` turned on and only if the user has the :ref:`"Add new string" permission <privileges>`.
sv: Det hÃ¤r alternativet Ã¤r bara tillgÃ¤ngligt nÃ¤r :ref:`component-manage_units` Ã¤r aktiverat och bara om anvÃ¤ndaren har behÃ¶righeten :ref:`"LÃ¤gg till ny strÃ¤ng" <privileges>`.

source: Conflicts handling
sv: Konflikthantering

source: Defines how to deal with uploaded strings which are already translated:
sv: Definierar hur man hanterar uppladdade strÃ¤ngar som redan Ã¤r Ã¶versatta:

source: Change only untranslated strings (``ignore``)
sv: Ãndra endast icke Ã¶versatta strÃ¤ngar (``ignore``)

source: Ignore uploaded translations which are already translated.
sv: Ignorera uppladdade Ã¶versÃ¤ttningar som redan Ã¤r Ã¶versatta.

source: Change translated strings (``replace-translated``)
sv: Ãndra Ã¶versatta strÃ¤ngar (``replace-translated``)

source: Replace existing translations with uploaded ones, but keep approved ones.
sv: ErsÃ¤tt befintliga Ã¶versÃ¤ttningar med uppladdade, men behÃ¥ll godkÃ¤nda Ã¶versÃ¤ttningar.

source: Change translated and approved strings (``replace-approved``)
sv: Ãndra Ã¶versatta och godkÃ¤nda strÃ¤ngar (``replace-approved``)

source: Replace existing translations with uploaded ones, including approved ones.
sv: ErsÃ¤tt befintliga Ã¶versÃ¤ttningar med uppladdade Ã¶versÃ¤ttningar, inklusive godkÃ¤nda Ã¶versÃ¤ttningar.

source: Strings needing edit
sv: StrÃ¤ngar som behÃ¶ver redigeras

source: There is also an option for how to handle strings needing edit in the imported file. Such strings can be handle in one of the three following ways: "Do not import", "Import as string needing edit", or "Import as translated".
sv: Det finns ocksÃ¥ ett alternativ fÃ¶r hur man ska hantera strÃ¤ngar som behÃ¶ver redigeras i den importerade filen. SÃ¥dana strÃ¤ngar kan hanteras pÃ¥ ett av fÃ¶ljande tre sÃ¤tt: "Importera inte", "Importera som strÃ¤ng som behÃ¶ver redigeras" eller "Importera som Ã¶versatt".

source: Overriding authorship
sv: Ãverordnad upphovsrÃ¤tt

source: With admin permissions, you can also specify authorship of uploaded file. This can be useful in case you've received the file in another way and want to merge it into existing translations while properly crediting the actual author.
sv: Med administratÃ¶rsbehÃ¶righet kan du ocksÃ¥ ange upphovsmannen till den uppladdade filen. Detta kan vara anvÃ¤ndbart om du har fÃ¥tt filen pÃ¥ annat sÃ¤tt och vill slÃ¥ ihop den med befintliga Ã¶versÃ¤ttningar samtidigt som du anger rÃ¤tt upphovsman.

source: Each project can include one or more glossaries as a shorthand for storing terminology. Glossaries help to maintain consistency of the translation.
sv: Varje projekt kan innehÃ¥lla en eller flera ordlistor som en fÃ¶rkortning fÃ¶r lagring av terminologi. Ordlistor hjÃ¤lper till att upprÃ¤tthÃ¥lla konsekvensen i Ã¶versÃ¤ttningen.

source: A glossary for each language can be managed on its own, but they are stored together as a single component which helps project admins and multilingual translators to maintain some cross-language consistency as well. Terms from the glossary containing words from the currently translated string are displayed in the sidebar of the translation editor.
sv: En ordlista fÃ¶r varje sprÃ¥k kan hanteras separat, men de lagras tillsammans som en enda komponent, vilket hjÃ¤lper projektadministratÃ¶rer och flersprÃ¥kiga Ã¶versÃ¤ttare att upprÃ¤tthÃ¥lla en viss sprÃ¥kÃ¶vergripande konsistens. Termer frÃ¥n ordlistan som innehÃ¥ller ord frÃ¥n den aktuella Ã¶versatta strÃ¤ngen visas i sidofÃ¤ltet i Ã¶versÃ¤ttningsredigeraren.

source: The glossary terms are not used in quality checks unless you enable that, see :ref:`check-check-glossary` for more information.
sv: Ordlistan anvÃ¤nds inte i kvalitetskontroller om du inte aktiverar den. Se :ref:`check-check-glossary` fÃ¶r mer information.

source: Managing glossaries
sv: Hantera ordlistor

source: Glossaries are now regular translation components and you can use all Weblate features on them â commenting, storing in a remote repository, or adding explanations.
sv: Ordlistor Ã¤r nu vanliga Ã¶versÃ¤ttningskomponenter och du kan anvÃ¤nda alla Weblate-funktioner pÃ¥ dem â kommentera, lagra i ett fjÃ¤rrarkiv eller lÃ¤gga till fÃ¶rklaringar.

source: Use any component as a glossary by turning on :ref:`component-is_glossary`. You can create multiple glossaries for one project.
sv: AnvÃ¤nd valfri komponent som ordlista genom att aktivera :ref:`component-is_glossary`. Du kan skapa flera ordlistor fÃ¶r ett projekt.

source: An empty glossary for a given project is automatically created with the project. Glossaries are shared among all components of the same project, and optionally with other projects using :ref:`component-links` from the respective glossary component.
sv: En tom ordlista fÃ¶r ett visst projekt skapas automatiskt tillsammans med projektet. Ordlistor delas mellan alla komponenter i samma projekt, och valfritt med andra projekt som anvÃ¤nder :ref:`component-links` frÃ¥n respektive ordlistkomponent.

source: The glossary component looks like any other component in Weblate with added colored label:
sv: Ordlistan ser ut som alla andra komponenter i Weblate, men har en extra fÃ¤rgad etikett:

source: You can browse all glossary terms:
sv: Du kan blÃ¤ddra bland alla termer i ordlistan:

source: or edit them as any translations.
sv: eller redigera dem som vilken Ã¶versÃ¤ttning som helst.

source: Glossary terms
sv: Ordlista

source: Glossary terms are translated the same way regular strings are. You can toggle additional features using the :guilabel:`Tools` menu for each term.
sv: Ordlista-termer Ã¶versÃ¤tts pÃ¥ samma sÃ¤tt som vanliga strÃ¤ngar. Du kan vÃ¤xla mellan ytterligare funktioner med hjÃ¤lp av :guilabel:`Verktyg`-menyn fÃ¶r varje term.

source: Untranslatable terms
sv: OÃ¶versÃ¤ttbara termer
